<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest LibreOffice, using the downloadarchive.documentfoundation.org repo. Set ARCH to either 'x86_64' or 'aarch64', defaults to 'x86_64'.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.LibreOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>BASE_URL</key>
		<string>https://downloadarchive.documentfoundation.org/libreoffice/old/latest/mac/%ARCH%/</string>
		<key>SEARCH_PATTERN</key>
		<string>(LibreOffice_(?P&lt;version&gt;[0-9]+.[0-9]+.[0-9]+.?[0-9]*)_MacOS_%aux_arch_name%.dmg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>LibreOffice uses both x86_64 AND x86-64 in the download path. Here we build the x86-64 or aarch64 part.</string>
			<key>Processor</key>
			<string>CreateLibreOfficeAuxArchName</string>
			<key>Arguments</key>
			<dict>
				<key>arch_name</key>
				<string>%ARCH%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%BASE_URL%</string>
					<key>re_pattern</key>
					<string>%SEARCH_PATTERN%</string>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://downloadarchive.documentfoundation.org/libreoffice/old/latest/mac/%ARCH%/LibreOffice_%version%_MacOS_%aux_arch_name%.dmg</string>
				<key>filename</key>
				<string>%NAME%-%ARCH%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LibreOffice.app</string>
				<key>requirement</key>
				<string>(identifier "org.libreoffice.script.LibreOffice" or identifier "org.libreoffice.script") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7P5S3ZLCN7"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
