<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SeaMonkey.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.SeaMonkey</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SeaMonkey</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
      <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.seamonkey-project.org/releases/</string>
                <key>re_pattern</key>
                <string>(https://archive.seamonkey-project.org/releases/([0-9]+.[0-9]+.[0-9]+.?[0-9]*)/mac/en-US/seamonkey-([0-9]+.[0-9]+.[0-9]+.?[0-9]*).en-US.mac.dmg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
