<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Steinberg Download Assistant and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.munki.SteinbergDownloadAssistant</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Steinberg Download Assistant Setup</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Steinberg Download Assistant</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Popular multimedia player.</string>
			<key>developer</key>
			<string>Steinberg Media Technologies</string>
			<key>display_name</key>
			<string>Steinberg Download Assistant</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/usr/bin/env zsh

"/tmp/Steinberg Download Assistant Setup.app/Contents/MacOS/installbuilder.sh" --mode unattended

/bin/rm -Rf "/tmp/Steinberg Download Assistant Setup.app"

/usr/sbin/chgrp -R staff /Library/Application\ Support/Steinberg/Content/*

exit 0
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.tonypaco.download.SteinbergDownloadAssistant</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
 				<key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath</string>
					<string>/tmp</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
