<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Fliqlo screen saver image</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.Fliqlo</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fliqlo</string>
		<key>CHECK_FILESIZE_ONLY</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Version ([0-9])\.([0-9])\.([0-9]) for</string>
				<key>url</key>
				<string>https://fliqlo.com/screensaver/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://fliqlo.com/download/Fliqlo%20%match%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>




