<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Jmol/JSmol.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.JmolJSmol</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jmol</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/SourceForgeBestReleaseURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>SOURCEFORGE_PROJECT_NAME</key>
				<string>jmol</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/RemoteFilenameFinder</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>CHECK_FILESIZE_ONLY</key>
                <true/>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.n8felton.shared/MD5Checksum</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>text_in</key>
				<string>%filename%</string>
				<key>re_pattern</key>
				<string>Jmol-([0-9]+.[0-9]+.[0-9]+)-binary.tar.gz</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
