<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Ricoh Vol1 PS Drivers.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.ricohprinterdriversv1</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Ricoh_PS_Printers_Vol1_EXP_LIO_Driver</string>
		<key>BASE_URL</key>
		<string>https://support.ricoh.com/bb/html/dr_ut_e/rc3/model/mp42/mp42.htm</string>
		<key>SEARCH_PATTERN</key>
		<string>href="(?P&lt;pkgurl&gt;http[^"]+-Ricoh_PS_Printers_Vol1_EXP_LIO_(?P&lt;version&gt;[0-9.]+).dmg)"</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%pkgurl%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Ricoh Co., Ltd. (5KACUT3YX8)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
         </dict>
      </dict>
    </dict>
	</array>
</dict>
</plist>
