<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports Respondus LockDown Browser Lab into Munki.</string>
    <key>Identifier</key>
    <string>com.github.tonypaco.munki.RespondusLockdownBrowserLab</string>
    <key>Input</key>
    <dict>
		<key>INSTITUTION_ID</key>
		<string>FILLINYOURINSTITUTIONID</string>
        <key>LAB_HASH</key>
        <string>FILLINYOURLABHASH</string>
		<key>NAME</key>
		<string>LockDownBrowserLab</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Respondus LockDown Browser Lab</string>
            <key>category</key>
            <string>Education</string>
            <key>developer</key>
            <string>Respondus</string>
            <key>display_name</key>
            <string>LockDown Browser Lab</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>preinstall_script</key>
            <string>#!/bin/bash

# The installation will fail without this directory
mkdir -p /var/root/Library/Logs
            </string>
			<key>postinstall_script</key>
			<string>#!/usr/bin/env zsh

/bin/echo "%INSTITUTION_ID%" &gt; "/Applications/LockDown Browser.app/id.txt"
/bin/chmod u=rw,go=r "/Applications/LockDown Browser.app/id.txt"

/bin/echo "%LAB_HASH%" &gt; "/Applications/LockDown Browser.app/lab.txt"
/bin/chmod u=rw,go=r "/Applications/LockDown Browser.app/lab.txt"

exit 0</string>
            <key>uninstall_method</key>
            <string>uninstall_script</string>
 			<key>uninstall_script</key>
			<string>#!/usr/bin/env zsh   

/bin/rm -Rf "/Applications/LockDown Browser.app"
/usr/sbin/pkgutil --forget com.respondus.LockdownBrowser.standard.pkg

exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.RespondusLockDownBrowser</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Install*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%found_filename%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                    <key>pkgdirs</key>
                    <dict/>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack/lockdownbrowser.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications/LockDown Browser (unconfigured).app</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications/LockDown Browser.app</string>
            </dict>
            <key>Processor</key>
            <string>FileMover</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>INSTITUTION_ID == "FILLINYOURINSTITUTIONID"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
	            <string>%INSTITUTION_ID%
</string>
                <key>file_mode</key>
                <string>0644</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications/LockDown Browser.app/id.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>LAB_HASH == "FILLINYOURLABHASH"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
       <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
	            <string>%LAB_HASH%
</string>
                <key>file_mode</key>
                <string>0644</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications/LockDown Browser.app/lab.txt</string>
            </dict>
        </dict>
         <dict>
            <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/application_payload</string>
                    <key>derive_minimum_os_version</key>
                    <string>true</string>
                    <key>version_comparison_key</key>
                    <string>CFBundleVersion</string>
                    <key>installs_item_paths</key>
                    <array>
                       <string>/Applications/LockDown Browser.app</string>
                    </array>
                </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Get rid of the receipts array, since it is always version 1 and the CFBundleVersion isn't also the real version of LockDown Browser.</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                        <key>receipts</key>
                        <array>
                            <dict>
                                <key>packageid</key>
                                <string>com.respondus.LockdownBrowser.standard.pkg</string>
                                <key>version</key>
                                <string>%version%</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
        </dict>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/application_payload</string>
					<string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>	
    </array>
</dict>
</plist>
