<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of wxMacMolPlt.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.wxMacMolPlt</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>wxMacMolPlt</string>
		<key>BASE_URL</key>
		<string>https://brettbode.github.io/wxmacmolplt/downloads.html</string>
		<key>PKG_SEARCH_PATTERN</key>
		<string>(&lt;H3&gt;Mac OS X&lt;\/H3&gt;\s*&lt;UL&gt;\s*&lt;LI&gt;&lt;a href="https:\/\/uofi\.box\.com\/shared\/static\/(?P&lt;pkgrandname&gt;[0-9a-z]{32})\.gz")</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%BASE_URL%</string>
			<key>re_pattern</key>
			<string>%PKG_SEARCH_PATTERN%</string>
			</dict>
		</dict>
		<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>filename</key>
			<string>%NAME%.zip</string>
			<key>url</key>
			<string>https://uofi.box.com/shared/static/%pkgrandname%.gz</string>
		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/Applications/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/Applications/MacMolPlt/wxMacMolPlt.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "gov.ameslab.wxMacMolplt" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = F28F22W7P9)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/Applications/MacMolPlt/wxMacMolPlt.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
