<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports shellcheck into munki via copy_from_dmg method</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.munki.shellcheck</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities/shellcheck</string>
		<key>NAME</key>
		<string>Shellcheck</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Incoming</string>
			</array>
	<key>category</key>
	<string>Developer Tools</string>
	<key>description</key>
	<string>&lt;!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd"&gt;
&lt;html&gt;
&lt;head&gt;
  &lt;meta http-equiv="Content-Type" content="text/html; charset=utf-8"&gt;
  &lt;meta http-equiv="Content-Style-Type" content="text/css"&gt;
  &lt;title&gt;&lt;/title&gt;
  &lt;meta name="Generator" content="Cocoa HTML Writer"&gt;
  &lt;meta name="CocoaVersion" content="2113.3"&gt;
  &lt;style type="text/css"&gt;
    p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica}
    p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica; min-height: 14.0px}
    li.li1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica}
    ul.ul1 {list-style-type: disc}
  &lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;p class="p1"&gt;Release notes can usually be found here: &lt;a href="https://github.com/koalaman/shellcheck/releases"&gt;https://github.com/koalaman/shellcheck/releases&lt;/a&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;
&lt;p class="p1"&gt;ShellCheck is a GPLv3 tool that gives warnings and suggestions for bash/sh shell scripts.&lt;br&gt;&lt;/p&gt;
&lt;p class="p1"&gt;The goals of ShellCheck are&lt;/p&gt;
&lt;ul class="ul1"&gt;
  &lt;li class="li1"&gt;To point out and clarify typical beginner's syntax issues that cause a shell to give cryptic error messages.&lt;/li&gt;
  &lt;li class="li1"&gt;To point out and clarify typical intermediate level semantic problems that cause a shell to behave strangely and counter-intuitively.&lt;/li&gt;
  &lt;li class="li1"&gt;To point out subtle caveats, corner cases and pitfalls that may cause an advanced user's otherwise working script to fail under future circumstances.&lt;/li&gt;
&lt;/ul&gt;
&lt;p class="p1"&gt;See &lt;a href="https://github.com/koalaman/shellcheck/blob/master/README.md#user-content-gallery-of-bad-code"&gt;the gallery of bad code&lt;/a&gt; for examples of what ShellCheck can help you identify!&lt;/p&gt;
&lt;/body&gt;
&lt;/html&gt;
</string>
	<key>developer</key>
	<string>Vidar 'koala_man' Holen</string>
	<key>display_name</key>
	<string>ShellCheck</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.scriptingosx.download.shellcheck</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_format</key>
				<string>tar</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/usr/local/bin/</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/usr/local/bin/shellcheck-v%version%/shellcheck</string>
                <key>target</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/usr/local/bin/shellcheck</string>
            </dict>
            <key>Processor</key>
            <string>FileMover</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpacked/usr/local/bin/shellcheck-v%version%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>installs_item_paths</key>
                <array>
					<string>/usr/local/bin/shellcheck</string>
                </array>
			</dict>
 			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/usr/local/bin</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--itemname</string>
					<string>shellcheck</string>
					<string>--destinationpath</string>
					<string>/usr/local/bin</string>
					<string>--owner</string>
					<string>root</string>
					<string>--group</string>
					<string>admin</string>
					<string>--mode</string>
					<string>u=rwx,go=rx</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpacked</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
