<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Google Chrome disk image and imports into Munki. Sets a force install date of FORCEDAYS (integrer) into the future at FORCETIME (HH:MM:SS). Defaults are 3 days at 16:00:00.</string>
    <key>Identifier</key>
    <string>com.github.tonypaco.munki.GoogleChrome</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleChrome</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>FORCEDAYS</key>
        <string>3</string>
        <key>FORCETIME</key>
        <string>16:00:00</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
            <key>display_name</key>
            <string>Google Chrome</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.googlechrome</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>deltas</key>
				<array>
					<dict>
						<key>datetime_format</key>
						<string>%Y-%m-%d</string>
						<key>direction</key>
						<string>future</string>
						<key>interval</key>
						<dict>
							<key>days</key>
							<integer>FORCEDAYS</integer>
						</dict>
						<key>output_name</key>
						<string>force_after</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>com.github.haircut.processors/DatetimeOutputter</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
 				<key>additional_makepkginfo_options</key>
				<array>
					<string>--force_install_after_date</string>
					<string>%force_after%T%FORCETIME%Z</string>
				</array>
           </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
