<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Google Cloud SDK and imports it into Munki.</string>
	<key>Comment</key>
	<string>ARCH is 'x86_64' for Intel (Default), 'arm' for Apple Silicon.
	FORCEFULL_MUNKI set to 'true' will, well, force a munki import.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.munki.GoogleCloudSDK</string>
  <key>Input</key>
  <dict>
	<key>FORCEFULL_MUNKI</key>
	<string>false</string>
	<key>ARCH</key>
	<string>x86_64</string>
    <key>NAME</key>
    <string>Google_Cloud_SDK</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>%NAME%</string>
    <key>DISPLAY_NAME</key>
    <string>Google Cloud SDK</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>developer</key>
      <string>Google</string>
      <key>display_name</key>
      <string>%DISPLAY_NAME%</string>
      <key>category</key>
      <string>Utilities</string>
      <key>description</key>
      <string>The Cloud SDK is a set of tools for Google's Cloud Platform.  You can run these tools interactively or in your automated scripts.</string>
	<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/usr/bin/env zsh

/bin/rm -Rf "/usr/local/google-cloud-sdk"

exit 0</string>
    </dict>
  </dict>
  <key>ParentRecipe</key>
  <string>com.github.tonypaco.download.GoogleCloudSDK</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/usr/local/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>installs_item_paths</key>
                <array>
					<string>/usr/local/google-cloud-sdk/VERSION</string>
                </array>
			</dict>
 			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/usr/local</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>force_munkiimport</key>
				<string>%FORCEFULL_MUNKI%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--itemname</string>
					<string>google-cloud-sdk</string>
					<string>--destinationpath</string>
					<string>/usr/local</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
