<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Kurzweil 3000 Web client disk image</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.KurzweilWeb</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kurzweil</string>
		<key>MAJOR_VERSION</key>
		<string>22</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.kurzweiledu.com/installv22_mac_wl</string>
                <key>prefetch_filename</key>
                <true/>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
