<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Kurzweil 3000 Web client disk image</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.download.KurzweilWeb</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kurzweil</string>
        <key>SEARCH_URL</key>
        <string>https://www.kurzweiledu.com/k3mac</string>
        <key>SEARCH_PATTERN</key>
        <string>(https://www\.kurzweiledu\.com/installv[0-9]{2}_mac_wl)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://www.kurzweiledu.com/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
