<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Enterprise Uninstaller and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.munki.AdobeUninstaller</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/adobe/Updaters</string>
		<key>NAME</key>
		<string>AdobeUninstaller</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creative Cloud</string>
			<key>description</key>
			<string>Installs a binary tool to assist with the programmatic removal of Adobe Creative Cloud applications. </string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Enterprise Uninstaller</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.AdobeUninstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>foo</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/AdobeUninstaller</string>
				<key>source_path</key>
				<string>%pathname%/AdobeUninstaller</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_file_path</key>
				<string>%destination_path%</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.BinaryFileVersioner/BinaryFileVersioner</string>
		</dict>
        <dict>
        	<key>Arguments</key>
			<dict>
				<key>split_on</key>
				<string>,</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--itemname</string>
					<string>AdobeUninstaller</string>
					<string>--destinationpath</string>
					<string>/usr/local/bin</string>
					<string>--owner</string>
					<string>root</string>
					<string>--group</string>
					<string>admin</string>
					<string>--mode</string>
					<string>u=rwx,go=rx</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
