<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of Focusrite Control.</string>

  <key>Identifier</key>
  <string>com.github.tonypaco.download.FocusriteControl</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>FocusriteControlScarlett18i20</string>
    <key>BASE_URL</key>
    <string>https://downloads.focusrite.com/focusrite/scarlett-3rd-gen/scarlett-18i20-3rd-gen</string>
    <key>DMG_SEARCH_PATTERN</key>
    <string>(https:\/\/fael-downloads-prod\.focusrite\.com\/customer\/prod\/downloads\/focusrite(?:-|_)control(?:-|_)[0-9]+(?:\.[0-9]+)*\.dmg(?:\.zip)?)</string>
  </dict>

  <key>MinimumVersion</key>
  <string>2.3</string>

  <key>Process</key>
  <array>

    <!-- Find the DMG URL on the product page -->
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%DMG_SEARCH_PATTERN%</string>
      </dict>
    </dict>

    <!-- Download the DMG (not a zip) -->
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%match%</string>
        <key>filename</key>
        <string>%NAME%.dmg</string>
      </dict>
    </dict>

    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>

    <!-- Mount the DMG so we can access the .pkg -->
    <dict>
      <key>Processor</key>
      <string>DmgMounter</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_path</key>
        <string>%pathname%</string>
      </dict>
    </dict>

    <!-- Verify the signed installer inside the DMG -->
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%mount_point%/Focusrite Control.pkg</string>
        <key>expected_authority_names</key>
        <array>
          <string>Developer ID Installer: Focusrite Audio Engineering Ltd. (7VYBQV3T2Q)</string>
          <string>Developer ID Certification Authority</string>
          <string>Apple Root CA</string>
        </array>
      </dict>
    </dict>

    <!-- Unpack and extract payload to read the app's version -->
    <dict>
      <key>Processor</key>
      <string>FlatPkgUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>flat_pkg_path</key>
        <string>%mount_point%/Focusrite Control.pkg</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>

    <dict>
      <key>Processor</key>
      <string>PkgPayloadUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_payload_path</key>
        <string>%RECIPE_CACHE_DIR%/unpack/Focusrite Control.pkg/Payload</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/payload</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>

    <dict>
      <key>Processor</key>
      <string>Versioner</string>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%RECIPE_CACHE_DIR%/payload/Applications/Focusrite Control.app/Contents/Info.plist</string>
        <key>plist_version_key</key>
        <string>CFBundleShortVersionString</string>
      </dict>
    </dict>

  </array>
</dict>
</plist>
