<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Recipe duplicated from homebysix in order to add the 3-day forceful installation requirement.</string>
	<key>Description</key>
	<string>Downloads the latest version of Arc and imports it into Munki. Also sets a force install by date of 3 days at 4PM.</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.munki.ArcBrowser</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Arc</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A new productivity-focused web browser.</string>
			<key>developer</key>
			<string>The Browser Company of New York</string>
			<key>display_name</key>
			<string>Arc</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.Arc</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>deltas</key>
				<array>
					<dict>
						<key>format</key>
						<string>%Y-%m-%d</string>
						<key>direction</key>
						<string>future</string>
						<key>interval</key>
						<dict>
							<key>days</key>
							<integer>3</integer>
						</dict>
						<key>output_name</key>
						<string>force_after</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>com.github.haircut.processors/DatetimeOutputter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--force_install_after_date</string>
					<string>%force_after%T16:00:00Z</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
