<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Visual Studio Code. and imports into Munki.</string>
	<key>Comment</key>
	<string>Alternate URL: https://update.code.visualstudio.com/latest/darwin-%DOWNLOAD_ARCH%-dmg/stable</string>
	<key>Identifier</key>
	<string>com.github.tonypaco.munki.visualstudiocode</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_ARCH</key>
		<string>universal</string>
		<key>DOWNLOAD_URL</key>
		<string>https://code.visualstudio.com/sha/download?build=stable&amp;os=darwin-%DOWNLOAD_ARCH%-dmg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/VisualStudioCode</string>
		<key>NAME</key>
		<string>VisualStudioCode</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Text Editors</string>
			<key>description</key>
			<string>Code combines the streamlined UI of a modern editor with rich code assistance and navigation, and an integrated debugging experience – without the need for a full IDE.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.tonypaco.download.visualstudiocode</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
